[
    {
        "id": "http://dbpedia.org/resource/Ca-bau-kan",
        "titulo": "Ca-bau-kan",
        "abstrato": "Ca-bau-kan (Chinese: 擦包看), also known as The Courtesan, is a 2002 Indonesian romantic drama film, directed by Nia Dinata, and starring Niniek L. Karim, and . It was distributed by and released on February 7, 2002 in Jakarta. The film was screened at the 2003 Palm Springs International Film Festival.",
        "país": [
            "Indonesia"
        ],
        "realizador": [
            "Nia Dinata"
        ],
        "elenco": [
            "http://dbpedia.org/resource/Niniek_L._Karim",
            "http://dbpedia.org/resource/Ferry_Salim",
            "http://dbpedia.org/resource/Lola_Amaria"
        ]
    },
    {
        "id": "http://dbpedia.org/resource/Cab_Calloway's_Jitterbug_Party",
        "titulo": "Cab Calloway's Jitterbug Party",
        "abstrato": "Cab Calloway's Jitterbug Party is a 1935 American musical short film which was released by Paramount Pictures (later sold to U.M. & M. TV Corporation). In 2001, the film was reissued by Kino International in the DVD collection Hollywood Rhythm: Vol. 1-The Best Of Jazz And Blues.",
        "país": [
            "United States"
        ],
        "realizador": [
            "Fred Waller"
        ],
        "elenco": [
            "http://dbpedia.org/resource/Cab_Calloway"
        ]
    },
    {
        "id": "http://dbpedia.org/resource/Cab_No._13",
        "titulo": "Cab No. 13",
        "abstrato": "Cab No. 13 (German: Fiaker Nr. 13 (Austria), Einspanner Nr 13 (Germany); Dutch: Snorder No. 13; French: Fiacre 13) is a 1926 drama film directed by Michael Curtiz and starring Lili Damita, Jack Trevor and Walter Rilla. The film's sets were designed by the art director Paul Leni. Location shooting took place in Paris.",
        "país": [],
        "realizador": [
            "Michael Curtiz"
        ],
        "elenco": []
    },
    {
        "id": "http://dbpedia.org/resource/Cab_Number_13",
        "titulo": "Cab Number 13",
        "abstrato": "Cab Number 13 (Italian: Il fiacre n. 13) is a 1948 Italian crime-melodrama film directed by Mario Mattoli and starring Vera Carmi.",
        "país": [
            "France",
            "Italy"
        ],
        "realizador": [
            "Mario Mattoli",
            "Raoul André"
        ],
        "elenco": [
            "http://dbpedia.org/resource/Vera_Carmi"
        ]
    },
    {
        "id": "http://dbpedia.org/resource/Caballerango",
        "titulo": "Caballerango",
        "abstrato": "Caballerango (Horse Wrangler) is a 2018 Mexican documentary film, director Juan Pablo González's debut feature. It's a portrait of residents of Milpillas in Los Altos de Jalisco as they grapple with the sudden death of a young horse wrangler named Nando. The editing alternates wide shots of landscape and community with more intimate scenes where the director, a native of the region himself, asks questions of those onscreen. Gradually, Nando's death starts to look like it might have been a suicide. It also becomes clear that the community's still reeling from the loss of several other young people. The mysterious circumstances of their demise dovetail with globalization's effects on the community: a drop in farming jobs and population exodus from the region. The film expands upon material that González's Cannes Critics' Week short, \"¿Por qué el recuerdo?\" (\"The Solitude of Memory\"), previously broached. It displays dimensions of slow cinema and includes only 37 shots across its 62-minute duration. The film's production occurred between 2013 and 2017, and it received support from the Sundance Institute, the Ford Foundation, the Austin Film Society, and the California Institute of the Arts, where González is a professor.",
        "país": [
            "Mexico"
        ],
        "realizador": [
            "Juan Pablo González"
        ],
        "elenco": []
    },
    {
        "id": "http://dbpedia.org/resource/Caballo_prieto_azabache_(film)",
        "titulo": "Caballo prieto azabache (film)",
        "abstrato": "Caballo prieto azabache (La tumba de Villa) is a 1968 Mexican historical drama film starring Antonio Aguilar, Flor Silvestre, and Jaime Fernández. It focuses on a horse breeder named Jesús who is set on buying a horse known as \"Caballo prieto\" (dark horse) and pursuing a relationship with a singer named Genoveva Alarios. With he and Genoveva eventually recruited as spies for the revolutionary leader Pancho Villa. The film was successful at the box-office and stayed in theaters for a surprising nine weeks.",
        "país": [
            "Mexico"
        ],
        "realizador": [],
        "elenco": [
            "http://dbpedia.org/resource/Jaime_Fernández_(actor)",
            "http://dbpedia.org/resource/Antonio_Aguilar",
            "http://dbpedia.org/resource/Flor_Silvestre"
        ]
    },
    {
        "id": "http://dbpedia.org/resource/Cabaret_(1927_film)",
        "titulo": "Cabaret (1927 film)",
        "abstrato": "Cabaret is a 1927 American silent crime drama film produced by Famous Players-Lasky, distributed by Paramount Pictures, directed by Robert G. Vignola, and starring Gilda Gray. The film was considered a rival to Paramount's own Underworld released later in 1927. Cabaret is now presumed to be a lost film. It was the winner of the Photoplay award in 1927.",
        "país": [
            "United States"
        ],
        "realizador": [
            "Robert G. Vignola"
        ],
        "elenco": [
            "http://dbpedia.org/resource/Gilda_Gray"
        ]
    },
    {
        "id": "http://dbpedia.org/resource/Cabaret_(1972_film)",
        "titulo": "Cabaret (1972 film)",
        "abstrato": "Cabaret is a 1972 American musical drama film directed by Bob Fosse, and starring Liza Minnelli, Michael York and Joel Grey. Set in Berlin during the Weimar Republic in 1931, under the presence of the growing Nazi Party, the film is loosely based on the 1966 Broadway musical Cabaret by Kander and Ebb, which was adapted from Christopher Isherwood's semi-autobiographical novel The Berlin Stories (1945) as well as John Van Druten's 1951 play I Am a Camera, which was itself adapted from Isherwood's novel. Multiple numbers from the stage score were used for the film, which also featured three other songs by Kander and Ebb, including two written for the adaptation. In the traditional manner of musical theater, most major characters in the stage version sing to express their emotions and advance the plot; in the film, however, the musical numbers are entirely diegetic. All of them take place inside the club, with one exception: \"Tomorrow Belongs to Me\", the only song sung by neither the Master of Ceremonies nor Sally Bowles. After the box-office failure of his 1969 film version of Sweet Charity, Fosse bounced back with Cabaret in 1972, a year that made him one of the most honored working directors in Hollywood. The film also brought Minnelli, daughter of Judy Garland and Vincente Minnelli, her own first chance to sing on screen, and she won the Academy Award for Best Actress. With Academy Awards for Best Supporting Actor (Grey), Best Director (Fosse), Best Cinematography, Best Art Direction, Best Sound, Best Original Song Score and Adaptation, and Best Film Editing, Cabaret holds the record for most Oscars earned by a film not honored for Best Picture. It is listed as number 367 on Empire's 500 greatest films of all time. Cabaret opened to glowing reviews and strong box office, eventually taking in more than $40 million. In addition to its eight Oscars, it won Best Picture citations from the National Board of Review and the Hollywood Foreign Press Association, and took Best Supporting Actor honors for Grey from the National Board of Review, the Hollywood Foreign Press, and the National Society of Film Critics. In 1995, Cabaret was the twelfth live-action musical film selected by the Library of Congress for preservation in the United States National Film Registry as being deemed \"culturally, historically, or aesthetically significant\".",
        "país": [
            "United States"
        ],
        "realizador": [
            "Bob Fosse"
        ],
        "elenco": [
            "http://dbpedia.org/resource/Fritz_Wepper",
            "http://dbpedia.org/resource/Liza_Minnelli",
            "http://dbpedia.org/resource/Helmut_Griem",
            "http://dbpedia.org/resource/Joel_Grey",
            "http://dbpedia.org/resource/Marisa_Berenson",
            "http://dbpedia.org/resource/Michael_York"
        ]
    },
    {
        "id": "http://dbpedia.org/resource/Cabaret_(2019_film)",
        "titulo": "Cabaret (2019 film)",
        "abstrato": "Cabaret is a 2019 Indian romantic drama thriller dance film directed by Kaustav Narayan Niyogi, produced by Pooja Bhatt and Bhushan Kumar under the banner of Fisheye Network private limited. Principal photography of the film began around 9 June 2015. Originally scheduled for a 2016 release, alleged copyright violations led to delays before its eventual release on 9 January 2019. It was released on the ZEE5 on 9 January 2019.",
        "país": [
            "India"
        ],
        "realizador": [],
        "elenco": [
            "http://dbpedia.org/resource/Richa_Chadda",
            "http://dbpedia.org/resource/S._Sreesanth",
            "http://dbpedia.org/resource/Gulshan_Devaiah"
        ]
    },
    {
        "id": "http://dbpedia.org/resource/Cabaret_Balkan",
        "titulo": "Cabaret Balkan",
        "abstrato": "Cabaret Balkan is a 1998 Serbian film directed by Goran Paskaljević starring Miki Manojlović and Nebojša Glogovac. Its original Serbian language title is Буре барута (Bure baruta) which means Powder Keg. It was released in English speaking countries under the title of Cabaret Balkan, with the official reason for the name change being that Kevin Costner had already registered a film project under the title Powder Keg. The film received a number of distinctions, including a FIPRESCI award at the Venice Film Festival in 1998. It was based on a play by the same title by . The film was selected as the Serbian entry for the Best Foreign Language Film at the 71st Academy Awards, but was not accepted as a nominee.",
        "país": [
            "Yugoslavia"
        ],
        "realizador": [
            "Goran Paskaljević"
        ],
        "elenco": [
            "http://dbpedia.org/resource/Bata_Živojinović",
            "http://dbpedia.org/resource/Bogdan_Diklić",
            "http://dbpedia.org/resource/Mirjana_Karanović",
            "http://dbpedia.org/resource/Dragan_Nikolić",
            "http://dbpedia.org/resource/Miki_Manojlović",
            "http://dbpedia.org/resource/Nebojša_Glogovac",
            "http://dbpedia.org/resource/Sergej_Trifunović"
        ]
    }
]